In [1]:
import pandas as pd
import numpy as np
from pandas import Series,DataFrame

In [2]:
n = np.nan

In [3]:
type(n)

float

In [4]:
m = 1
m+n

nan

# Nan in Series

In [12]:
s1 = Series([1,2,np.nan,3,4],index=['A','B','C','D','E'])

In [13]:
s1

A    1.0
B    2.0
C    NaN
D    3.0
E    4.0
dtype: float64

In [14]:
s1.isnull()

A    False
B    False
C     True
D    False
E    False
dtype: bool

In [15]:
s1.notnull()

A     True
B     True
C    False
D     True
E     True
dtype: bool

In [16]:
s1.dropna()

A    1.0
B    2.0
D    3.0
E    4.0
dtype: float64

# Nan in DataFrame

In [17]:
df = DataFrame([[1,2,3],[np.nan,5,6],[7,np.nan,9],[np.nan,np.nan,np.nan]])

In [18]:
df

     0    1    2
0  1.0  2.0  3.0
1  NaN  5.0  6.0
2  7.0  NaN  9.0
3  NaN  NaN  NaN

In [20]:
df.isnull()

       0      1      2
0  False  False  False
1   True  False  False
2  False   True  False
3   True   True   True

In [24]:
df1 = df.dropna(axis=0, how='any')
#axis = 0 ,how='any'  行只要有0就删除该行
#           how='all'  全是nan则删除

In [27]:
df1

     0    1    2
0  1.0  2.0  3.0

In [38]:
df2 = DataFrame([[1,2,3],[np.nan,5,6],[7,np.nan,9],[np.nan,np.nan,np.nan]])
df2

     0    1    2
0  1.0  2.0  3.0
1  NaN  5.0  6.0
2  7.0  NaN  9.0
3  NaN  NaN  NaN

In [39]:
df2.dropna(thresh=2)#个数大于2的nan的行才会删除

     0    1    2
0  1.0  2.0  3.0
1  NaN  5.0  6.0
2  7.0  NaN  9.0

In [42]:
#按列填充
df2.fillna(value={0:0,1:1,2:2})

     0    1    2
0  1.0  2.0  3.0
1  0.0  5.0  6.0
2  7.0  1.0  9.0
3  0.0  1.0  2.0

     0    1    2
0  1.0  2.0  3.0
1  NaN  5.0  6.0
2  7.0  NaN  9.0
3  NaN  NaN  NaN